app/controllers/v1/companies_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "companies" ("name", "cnpj", "cep", "street", "number", "city", "state", "user_id", "created_at", "updated_at") VALUES ('foo', '3123123129831', '231234131', 'dasda', 2, 'casda', 'sc', 1, '2025-05-07 19:18:48.023970', '2025-05-07 19:18:48.023970') RETURNING "id"
---
    def create
      user = User.find(params[:user_id])
      company = user.companies.create!(company_create_params)

UPDATE "companies" SET "cnpj" = '84.239.843/2984-72', "cep" = '83748-923', "state" = 'MT', "updated_at" = '2025-05-07 19:58:57.906533' WHERE "companies"."id" = 1
---
    def update
      authorize @company
      @company.update!(company_update_params)