app/commands/user_command/create.rb

    def call
      user = User.create! @params
---
INSERT INTO "users" ("email", "password_digest", "name", "cpf", "phone", "role", "verification_token", "verification_token_sent_at", "created_at", "updated_at") VALUES ('foo@bar.com', '$2a$12$FsoUYAkMwKHcbpf8gDZBaeo/rXf6stw8UZFmVPSPkvF6f9jmh1Cta', 'Foo Bar', '123456789', '11911391581', 'admin', NULL, NULL, '2025-05-07 18:29:46.658598', '2025-05-07 18:29:46.658598') RETURNING "id"