app/controllers/concerns/secured.rb

  def authenticate_request!
    @current_user ||= User.eager_load(:companies).find(auth_session_user_id) if auth_token
---
SELECT DISTINCT "users"."id" FROM "users" LEFT OUTER JOIN "companies" ON "companies"."user_id" = "users"."id" WHERE "users"."id" = 1 LIMIT 1